FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_dtc_rx/src/r_dtc_rx.c
static dtc_err_t r_dtc_set_transfer_data(dtc_transfer_data_t *p_transfer_data,
                                         dtc_transfer_data_cfg_t *p_cfg);
static void r_dtc_clear_all_dtce_bits(void);
static bool r_dtc_abort_chain_transfer(uint32_t chain_transfer_nr);
static bool r_dtc_acquire_hw_lock(void);
static void r_dtc_release_hw_lock(void);
static bool r_dtc_check_dmac_locking_sw(void);
static dtc_err_t r_dtc_check_create_param(dtc_transfer_data_t *p_transfer_data, dtc_transfer_data_cfg_t *p_data_cfg);



/***********************************************************************************************************************
* Function Name: R_DTC_Open
********************************************************************************************************************//**
* @brief This function is run first when using the APIs of the DTC FIT module.
* @retval DTC_SUCCESS Successful operation
* @retval DTC_ERR_OPENED DTC has been initialized already.
* @retval DTC_ERR_BUSY Resource has been locked by other process.
* @details Locks*1 the DTC and starts supplying clock to DTC, then initializes DTC vector table, address mode,
* Data Transfer Read Skip. When setting DTC_CFG_DISABLE_ALL_ACT_SOURCE to DTC_ENABLE in r_dtc_rx_config.h, all DTCER
* registers are cleared. When setting DTC_CFG_USE_SEQUENCE_TRANSFER to DTC_ENABLE, the area used in DTC index table is
* secured.\n\n
* Note: 1. The DTC FIT module uses the r_bsp default lock function. As a result, the DTC is in the locked state after a
* successful end.
* @note Set \#define BSP_CFG_HEAP_BYTES in r_bsp_config.h to the value greater than \#define DTC_VECTOR_TABLE_SIZE_BYTES
* in r_dtc_rx_target.h. This is to secure the DTC Vector table area using the malloc() function in the DTC FIT module.
*/
dtc_err_t R_DTC_Open(void)
{
    uint8_t * p_dtc_table_work2 = 0;

    /* Check hw lock require */
    if (false == r_dtc_acquire_hw_lock())
    {
        /* Lock has already been acquired by another task. Need to try again later. */
        return DTC_ERR_BUSY;
    }

    if (true == s_is_opened) /* DTC is opened. */
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_OPENED;
    }

    /* Allocate memory size */
    gp_dtc_table_work[0] = (uint32_t *)malloc(DTC_VECTOR_TABLE_SIZE_BYTES);

    if (0 == gp_dtc_table_work[0])
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_OPENED;
    }

    gp_dtc_table_work[1] = gp_dtc_table_work[0];

    /* Cast type of "gp_dtc_table_work" to match type of "p_dtc_table_work2" */
    p_dtc_table_work2 = (uint8_t *)gp_dtc_table_work[1];
    p_dtc_table_work2 = (p_dtc_table_work2 + 0x400);

    /* Cast type of "p_dtc_table_work2" to match type of "p_dtc_table_work2" */
    p_dtc_table_work2 = (uint8_t *)((uint32_t)p_dtc_table_work2 & 0xfffffc00);

#if (DTC_ENABLE == DTC_CFG_DISABLE_ALL_ACT_SOURCE) /* Clear all DTCER registers. */

    r_dtc_clear_all_dtce_bits();

#endif /* DTC_ENABLE == DTC_CFG_DISABLE_ALL_ACT_SOURCE */

    /* Cancel module stop for DMAC and DTC. */
    r_dtc_module_enable();

    /* Set DTC Vector Table Base Register. */
    DTC.DTCVBR = p_dtc_table_work2;

#if (DTC_ENABLE == DTC_CFG_USE_SEQUENCE_TRANSFER)
    p_dtc_table_work2 = (p_dtc_table_work2 + 0x400);

    /* Set address of the dtc index table. */
    DTC.DTCIBR = p_dtc_table_work2;
#endif /* (DTC_ENABLE == DTC_CFG_USE_SEQUENCE_TRANSFER) */

    /* Set DTC address mode. */
#if (DTC_ENABLE == DTC_CFG_SHORT_ADDRESS_MODE)
    /*Turn on Short Address Mode*/
    DTC.DTCADMOD.BIT.SHORT = 1;
#else /* Full-address mode */
    DTC.DTCADMOD.BIT.SHORT = 0;
#endif /* DTC_CFG_SHORT_ADDRESS_MODE */

    /* Set the Transfer Data Read Skip bit. */
#if (DTC_ENABLE == DTC_CFG_TRANSFER_DATA_READ_SKIP_EN) /* Enable Data Read Skip. */
    DTC.DTCCR.BIT.RRS = 1;
#else /* Disable Data Read Skip. */
    DTC.DTCCR.BIT.RRS = 0;
#endif /* DTC_TRANSFER_DATA_READ_SKIP_EN */
    s_is_opened = true; /* DTC module is initialized successfully. */

    return DTC_SUCCESS;
}
/* End of function R_DTC_Open */

/***********************************************************************************************************************
* Function Name: R_DTC_Create
********************************************************************************************************************//**
* @brief This function is used to make DTC register settings and to specify the activation source.
* @param[in] act_source Activation source.
* @param[in] p_transfer_data Pointer to start address of Transfer data area on RAM.
* @param[in] p_data_cfg Pointer to settings for Transfer data. In the case of DTCb, the setting to the following
* structure members is invalid. This function sets the following values.\n
* p_data_cfg->writeback_disable = DTC_WRITEBACK_ENABLE;\n
* p_data_cfg->sequence_end = DTC_SEQUENCE_TRANSFER_CONTINUE;\n
* p_data_cfg->refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE;\n
* p_data_cfg->disp_add_enable = DTC_SRC_ADDR_DISP_ADD_DISABLE;\n
* @param[in] chain_transfer_nr Number of chain transfer.\n
* The number of Transfer data and corresponding configurations is (number of chain transfer + 1).
* Example: if chain_transfer_nr = 1, it means that there are 2 continuous Transfer data and 2 corresponding configurations
* and the first configuration enable the chain transfer.\n
* See Section 3 in application note for details.
* @retval DTC_SUCCESS Successful operation
* @retval DTC_ERR_NOT_OPEN DTC is not initialized yet.
* @retval DTC_ERR_INVALID_ARG Parameters are invalid.
* @retval DTC_ERR_NULL_PTR Argument pointers are NULL.
* @details Writes the configuration to Transfer data. Writes the start address of Transfer data corresponding to interrupt
* number into DTC vector table.
* @note Before calling R_DTC_Create(), user must disable the current interrupt request (the interrupt source is passed to
* R_DTC_Create()) by clearing Interrupt Request Enable bit IERm.IENj:\n\n
* ICU.IER[m].BIT.IENj = 0;\n\n
* Then, enable the interrupt request disabled after R_DTC_Create() is ended. The correspondence between IERm.IENj bit and
* interrupt source is described in Interrupt Vector Table, chapter Interrupt Controller (ICU) of User's Manual: Hardware.
*/
dtc_err_t R_DTC_Create(dtc_activation_source_t act_source, dtc_transfer_data_t *p_transfer_data,
                       dtc_transfer_data_cfg_t *p_data_cfg, uint32_t chain_transfer_nr)
{
    uint32_t  count                             = chain_transfer_nr + 1;
    uint32_t *p_ptr                             = NULL;
    uint8_t   dtce_backup                       = 0;
    uint8_t   rrs_backup                        = 0;
    dtc_err_t ret                               = DTC_SUCCESS;
    dtc_transfer_data_t *p_transfer_data_backup = NULL;

    ret = r_dtc_check_create_param(p_transfer_data, p_data_cfg);
    if (DTC_SUCCESS != ret)
    {
        return ret;
    }

