FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_dtc_rx/src/r_dtc_rx.c
    if (false == s_is_opened) /* DTC is not initialized yet. */
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_NOT_OPEN;
    }

    /* Store start address of p_args->p_transfer_data. */
    p_transfer_data_backup = p_transfer_data;

    /* Store old value of DTCERn.DTCE bit. */
    dtce_backup = ICU.DTCER[act_source].BIT.DTCE;

    /* Disable the interrupt source. Clear the DTCER */
    ICU.DTCER[act_source].BIT.DTCE = 0;

    /* Store old value of DTCCR.RRS bit. */
    rrs_backup = DTC.DTCCR.BIT.RRS;

    /* Clear RRS bit. */
    DTC.DTCCR.BIT.RRS = 0;

    /* Apply configurations */
    /* WAIT_LOOP */
    while (count > 0)
    {

#if (DTC_IP_VER_DTCb <= DTC_IP)
        /* Set the 0 value. */
        p_data_cfg->writeback_disable        = DTC_WRITEBACK_ENABLE;
        p_data_cfg->sequence_end             = DTC_SEQUENCE_TRANSFER_CONTINUE;
        p_data_cfg->refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE;
        p_data_cfg->disp_add_enable          = DTC_SRC_ADDR_DISP_ADD_DISABLE;
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

        if (r_dtc_set_transfer_data(p_transfer_data, p_data_cfg) != DTC_SUCCESS)
        {
            /* Fail to apply configurations for Transfer data. */
            /* Restore RRS bit */
            DTC.DTCCR.BIT.RRS = rrs_backup;

            /* Restore the DTCE bit. */
            ICU.DTCER[act_source].BIT.DTCE = dtce_backup;
            return DTC_ERR_INVALID_ARG;
        }
        else
        {
            p_data_cfg++;
            p_transfer_data++;
        }
        count--;
    }

    /* The row in Vector table corresponding to act_source */
    p_ptr = (uint32_t *)((uint32_t)DTC.DTCVBR + (4 * act_source));

    /* Write start address of Transfer data to Vector table. */
    *p_ptr = (uint32_t)p_transfer_data_backup;

    /* Restore RRS bit. */
    DTC.DTCCR.BIT.RRS = rrs_backup;

    /* Restore the DTCE bit. */
    ICU.DTCER[act_source].BIT.DTCE = dtce_backup;

    return DTC_SUCCESS;
}
/* End of function R_DTC_Create */

/***********************************************************************************************************************
* Function Name: R_DTC_CreateSeq
********************************************************************************************************************//**
* @brief This function performs the setting of the DTC register used in the sequence transfer and the activation source.
* @param[in] act_source Activation source
* @param[in] p_transfer_data Pointer to the start address in the transfer information area in RAM.
* @param[in] p_data_cfg Pointer to the transfer information setting\n
* Set the following structure members.\n
* p_data_cfg->writeback_disable\n
* p_data_cfg->sequence_end\n
* p_data_cfg->refer_index_table_enable\n
* p_data_cfg->disp_add_enable\n
* @param[in] sequence_transfer_nr Transfer information counts per sequence transfer (0 - 4294967295)\n
* See Section 3 in application note for details.\n\n
* @param[in] sequence_no Sequence number (0 - 255)\n
* The type definition of the transfer information and the data structure are the same as R_DTC_Create(). Total of 256 ways
* of the sequence information can be set.
* @retval DTC_SUCCESS Successful operation
* @retval DTC_ERR_NOT_OPEN DTC is not initialized yet.
* @retval DTC_ERR_INVALID_ARG Arguments are invalid.
* @retval DTC_ERR_NULL_PTR Argument pointers are NULL.
* @details This function writes the setting information to the transfer information. Start address of the transfer
* information for the sequence number is written to DTC index table.
* @note Before calling R_DTC_CreateSeq(), user must disable the current interrupt request (the interrupt source is passed
* to R_DTC_CreateSeq()) by clearing Interrupt Request Enable bit (IERm.IENj):\n\n
* ICU.IER[m].BIT.IENj = 0;\n\n
* Then, enable the interrupt request disabled after R_DTC_CreateSeq() is ended. The correspondence between IERm.IENj bit
* and interrupt source is described in Interrupt Vector Table, chapter Interrupt Controller (ICU) of User's Manual:
* Hardware.
*/
dtc_err_t R_DTC_CreateSeq(dtc_activation_source_t act_source, dtc_transfer_data_t *p_transfer_data,
                          dtc_transfer_data_cfg_t *p_data_cfg, uint32_t sequence_transfer_nr,
                          uint8_t sequence_no)
{
#if (DTC_DISABLE == DTC_CFG_USE_SEQUENCE_TRANSFER)
    return DTC_ERR_INVALID_ARG;
#else
    uint32_t  count                             = sequence_transfer_nr;
    uint32_t *p_ptr                             = NULL;
    uint8_t   dtce_backup                       = 0;
    uint8_t   rrs_backup                        = 0;
    dtc_err_t ret                               = DTC_SUCCESS;
    dtc_transfer_data_t *p_transfer_data_backup = NULL;

    if (0 != count)
    {
        ret = r_dtc_check_create_param(p_transfer_data, p_data_cfg);
        if (DTC_SUCCESS != ret)
        {
            return ret;
        }
    }

    if (false == s_is_opened) /* DTC is not initialized yet. */
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_NOT_OPEN;
    }

    /* Store start address of p_args->p_transfer_data. */
    p_transfer_data_backup = p_transfer_data;

    /* Store old value of DTCERn.DTCE bit. */
    dtce_backup = ICU.DTCER[act_source].BIT.DTCE;

    /* Disable the interrupt source. Clear the DTCER */
    ICU.DTCER[act_source].BIT.DTCE = 0;

    /* Store old value of DTCCR.RRS bit. */
    rrs_backup = DTC.DTCCR.BIT.RRS;

    /* Clear RRS bit. */
    DTC.DTCCR.BIT.RRS = 0;

    /* The row in dtc index table corresponding to sequence_no. */
    p_ptr = (uint32_t *)((uint32_t)DTC.DTCIBR + (4 * sequence_no));

    if (0 == count)
    {
        /* Set the cpu interrupt to the sequence number. */
        *p_ptr = DTC_INVALID_CMND;
    }
    else
    {
        /* Apply configurations */
        /* WAIT_LOOP */
        while (count > 0)
        {
            /* Fail to apply configurations for Transfer data. */
            if (r_dtc_set_transfer_data(p_transfer_data, p_data_cfg) != DTC_SUCCESS)
            {
                /* Restore RRS bit */
                DTC.DTCCR.BIT.RRS = rrs_backup;

